# Pandas
## Series

In [1]:
import numpy as np
import pandas as pd

In [6]:
lst = [i**2 for i in range(10)]

In [7]:
pd.Series(lst)

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int64

In [8]:
number_names = ["zero", "one", "two", "three", "four", "five", "six", "seven", "eight", "nine"]

In [10]:
pd.Series(lst, number_names)

zero      0
one       1
two       4
three     9
four     16
five     25
six      36
seven    49
eight    64
nine     81
dtype: int64

In [11]:
np_arr = np.arange(0,10,2)

In [12]:
pd.Series(np_arr)

0    0
1    2
2    4
3    6
4    8
dtype: int64

In [13]:
dictionary = {"a":1, "b":2, "c":3}

In [14]:
pd.Series(dictionary)

a    1
b    2
c    3
dtype: int64

## Calculation with series

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {"apples":3, "pears":2, "bananas": 1}
dict2 = {"apples":5, "bananas":2, "grapes":10}

In [3]:
fruit_series = pd.Series(dict1)
fruit_series2 = pd.Series(dict2)

In [4]:
fruit_series

apples     3
pears      2
bananas    1
dtype: int64

In [5]:
fruit_series2

apples      5
bananas     2
grapes     10
dtype: int64

In [6]:
fruit_series + fruit_series2

apples     8.0
bananas    3.0
grapes     NaN
pears      NaN
dtype: float64

## DataFrames

In [7]:
lst = [x**3 for x in range(25)]

In [9]:
np_arr = np.array(lst)

In [13]:
np_arr_resh = np_arr.reshape(5,5)

In [18]:
cols = ["Cars", "Horses", "Bicycles", "Flowers", "Electricity"]
rows = ["Germany", "USA", "France", "Italy", "China"]

In [19]:
np_arr_resh

array([[    0,     1,     8,    27,    64],
       [  125,   216,   343,   512,   729],
       [ 1000,  1331,  1728,  2197,  2744],
       [ 3375,  4096,  4913,  5832,  6859],
       [ 8000,  9261, 10648, 12167, 13824]])

In [20]:
countries_df = pd.DataFrame(np_arr_resh, index = rows, columns = cols)

In [21]:
countries_df

         Cars  Horses  Bicycles  Flowers  Electricity
Germany     0       1         8       27           64
USA       125     216       343      512          729
France   1000    1331      1728     2197         2744
Italy    3375    4096      4913     5832         6859
China    8000    9261     10648    12167        13824

In [24]:
countries_df["Cars"]

Germany       0
USA         125
France     1000
Italy      3375
China      8000
Name: Cars, dtype: int64

In [27]:
countries_df[["Cars", "Bicycles"]]

         Cars  Bicycles
Germany     0         8
USA       125       343
France   1000      1728
Italy    3375      4913
China    8000     10648

In [28]:
countries_df[["Cars"]]

         Cars
Germany     0
USA       125
France   1000
Italy    3375
China    8000

In [30]:
countries_df["Transportation"] = countries_df["Cars"] + countries_df["Bicycles"]

In [32]:
countries_df["Random_Merit"] = countries_df["Horses"] * countries_df["Flowers"]

In [34]:
countries_df["Random_Merit_2"] = countries_df["Electricity"] / countries_df["Cars"]

In [35]:
countries_df

,Cars,Horses,Bicycles,Flowers,Electricity,Transportation,Random_Merit,Random_Merit_2
Germany,0,1,8,27,64,8,27,inf
USA,125,216,343,512,729,468,110592,5.832000
France,1000,1331,1728,2197,2744,2728,2924207,2.744000
Italy,3375,4096,4913,5832,6859,8288,23887872,2.032296
China,8000,9261,10648,12167,13824,18648,112678587,1.728000

In [40]:
countries_df.drop("Random_Merit_2", axis=1, inplace = True)

In [41]:
countries_df

,Cars,Horses,Bicycles,Flowers,Electricity,Transportation,Random_Merit
Germany,0,1,8,27,64,8,27
USA,125,216,343,512,729,468,110592
France,1000,1331,1728,2197,2744,2728,2924207
Italy,3375,4096,4913,5832,6859,8288,23887872
China,8000,9261,10648,12167,13824,18648,112678587